In [8]:
import pandas as pd

df = pd.read_csv(r'C:\Users\Alexey\Desktop\GB\Python\swork\s9\california_housing_test.csv')

In [9]:
df.shape

(3000, 9)

In [11]:
df.head(3)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-122.05,37.37,27.0,3885.0,661.0,1537.0,606.0,6.6085,344700.0
1,-118.30,34.26,43.0,1510.0,310.0,809.0,277.0,3.5990,176500.0
2,-117.81,33.78,27.0,3589.0,507.0,1484.0,495.0,5.7934,270500.0

In [12]:
df.dtypes

longitude             float64
latitude              float64
housing_median_age    float64
total_rooms           float64
total_bedrooms        float64
population            float64
households            float64
median_income         float64
median_house_value    float64
dtype: object

In [13]:
df.isnull().sum() #проверка на ненулевые

longitude             0
latitude              0
housing_median_age    0
total_rooms           0
total_bedrooms        0
population            0
households            0
median_income         0
median_house_value    0
dtype: int64

In [15]:
df.columns #список столбцов

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [21]:
df[["longitude", "latitude"]] #выделяем столбцы

      longitude  latitude
0       -122.05     37.37
1       -118.30     34.26
2       -117.81     33.78
3       -118.36     33.82
4       -119.67     36.33
...         ...       ...
2995    -119.86     34.42
2996    -118.14     34.06
2997    -119.70     36.30
2998    -117.12     34.10
2999    -119.63     34.42

[3000 rows x 2 columns]

In [31]:
df.loc[:, ["longitude", "latitude"]] #обращается по элементам

      longitude  latitude
0       -122.05     37.37
1       -118.30     34.26
2       -117.81     33.78
3       -118.36     33.82
4       -119.67     36.33
...         ...       ...
2995    -119.86     34.42
2996    -118.14     34.06
2997    -119.70     36.30
2998    -117.12     34.10
2999    -119.63     34.42

[3000 rows x 2 columns]

In [33]:
df.iloc[:, :2] #обращается по индексам

      longitude  latitude
0       -122.05     37.37
1       -118.30     34.26
2       -117.81     33.78
3       -118.36     33.82
4       -119.67     36.33
...         ...       ...
2995    -119.86     34.42
2996    -118.14     34.06
2997    -119.70     36.30
2998    -117.12     34.10
2999    -119.63     34.42

[3000 rows x 2 columns]

In [40]:
df[
    (df['housing_median_age'] < 20) &    #сортировка по значению
    (df['median_house_value'] > 70000)   #сортировка по значению 2, если не и (&), а или, используем |    
][['median_house_value']] #обращаемся к столбцу фрейма через точку без кавычек либо с заголовком через [[]]

      median_house_value
4                81700.0
7               166900.0
8               194400.0
13              231200.0
16              181300.0
...                  ...
2978            139700.0
2981            171300.0
2984            107000.0
2985            109400.0
2991            253800.0

[792 rows x 1 columns]

In [38]:
# df.to_csv('res.csv')

In [51]:
df['median_house_value'].max()

500001.0

In [52]:
df['median_house_value'].min()

22500.0

In [54]:
df.describe() #имба

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,3000.000000,3000.00000,3000.000000,3000.000000,3000.000000,3000.000000,3000.00000,3000.000000,3000.00000
mean,-119.589200,35.63539,28.845333,2599.578667,529.950667,1402.798667,489.91200,3.807272,205846.27500
std,1.994936,2.12967,12.555396,2155.593332,415.654368,1030.543012,365.42271,1.854512,113119.68747
min,-124.180000,32.56000,1.000000,6.000000,2.000000,5.000000,2.00000,0.499900,22500.00000
25%,-121.810000,33.93000,18.000000,1401.000000,291.000000,780.000000,273.00000,2.544000,121200.00000
50%,-118.485000,34.27000,29.000000,2106.000000,437.000000,1155.000000,409.50000,3.487150,177650.00000
75%,-118.020000,37.69000,37.000000,3129.000000,636.000000,1742.750000,597.25000,4.656475,263975.00000
max,-114.490000,41.92000,52.000000,30450.000000,5419.000000,11935.000000,4930.00000,15.000100,500001.00000

In [61]:
df[ 
    (df['median_income'] == 3.1250)   #ищем максимум для определенного значения медианного дохода
].median_house_value.max()

233300.0

In [71]:
df[ 
    (df['median_income'] == 3.1250)   #сортируем
].sort_values(by='median_house_value', ascending=False).head(1)  #shift+tab для показа документации, .head дает первую строку

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
784,-118.31,33.8,30.0,3096.0,757.0,2048.0,704.0,3.125,233300.0

In [73]:
min_house = df.median_house_value.min()
df[
    (df['median_house_value'] == min_house)
].population.max()

1230.0